# =============================================================================
# Brewfile - Essential macOS Development Tools
# =============================================================================
# Install with: brew bundle --file=Brewfile
# =============================================================================

# Taps
tap "homebrew/bundle"

# -----------------------------------------------------------------------------
# Core Tools
# -----------------------------------------------------------------------------
brew "git"                  # Version control
brew "neovim"               # Modern vim
brew "stow"                 # Symlink farm manager
brew "starship"             # Cross-shell prompt

# -----------------------------------------------------------------------------
# Search & Navigation
# -----------------------------------------------------------------------------
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast grep alternative (rg)
brew "fd"                   # Fast find alternative
brew "eza"                  # Modern ls replacement
brew "zoxide"               # Smarter cd command
brew "tree"                 # Directory tree view

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
brew "gh"                   # GitHub CLI
brew "git-delta"            # Better git diffs
brew "git-lfs"              # Git large file storage
brew "tmux"                 # Terminal multiplexer
brew "jq"                   # JSON processor
brew "yq"                   # YAML processor
brew "httpie"               # Modern curl alternative

# -----------------------------------------------------------------------------
# Languages & Runtimes
# -----------------------------------------------------------------------------
brew "node"                 # Node.js
brew "python"               # Python 3
brew "rustup"               # Rust toolchain

# -----------------------------------------------------------------------------
# Applications
# -----------------------------------------------------------------------------
cask "ghostty"              # GPU-accelerated terminal
